crathje/ESP32_A1S_Radio/src/main.cpp
#include <Arduino.h>

// based on
// https://github.com/schreibfaul1/ESP32-audioI2S/blob/master/examples/ESP32_A1S/ESP32_A1S.ino

// default some DAC
#ifndef DAC2USE_ES8388
#ifndef DAC2USE_AC101
#define DAC2USE_ES8388 1
// #define DAC2USE_AC101 1
#endif
#endif

#ifdef DAC2USE_AC101
#include "AC101.h" // https://github.com/schreibfaul1/AC101
#endif
#ifdef DAC2USE_ES8388
#include "ES8388.h" // https://github.com/maditnerd/es8388
#endif
#include <ArduinoOTA.h>
#include <ESPAsyncWebServer.h>   // https://github.com/me-no-dev/ESPAsyncWebServer
#include <ESPAsyncWiFiManager.h> // https://github.com/tzapu/WiFiManager
#include <ESP32Encoder.h>        // https://github.com/madhephaestus/ESP32Encoder
#include <ElegantOTA.h>
#include <ArduinoJson.h>
#include "SPIFFS.h"

#include <Wire.h>
TwoWire I2C_2 = TwoWire(1);
#define SSD1306_ADDRESS 0x3C

#include <Adafruit_SSD1306.h>
// #include <U8g2lib.h>

#include "Audio.h" //https://github.com/schreibfaul1/ESP32-audioI2S
AsyncWebServer asyncWebServer(80);
AsyncWebSocket asyncWebSocket("/ws");
DNSServer dnsServer;
char hostname[32 + 1];
const char compile_date[] = __DATE__ " " __TIME__;

char lastPlayedUrl[2048];
char lastPlayedStreamTitle[2048];
char lastPlayedStation[2048];

JsonDocument configJSON;
const char *CONFIGFILENAME = "/radioconf.json";
#define _MAX_JSONBUFFERSIZE 2048

volatile int currentStationNum = 0;

const char index_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="en">

<head>
    <style>
        a:link {
            text-decoration: none;
            font-size: 40px;
        }

        div {
            margin: 2px;
        }

        .lcd {
            font-family: 'LCD', sans-serif;
            border: 0px;
            padding: 5px;
            color: mediumaquamarine;
            background-color: black;
            font-size: xx-large;
        }

        .smalllcd {
            font-family: 'LCD', sans-serif;
            border: 0px;
            padding: 5px;
            color: greenyellow;
            background-color: black;
            font-size: large;
        }

        .buttonscontainer {
            text-align: center;
        }

        .button {
            border: none;
            background-color: #cccccc;
            padding: 15px 32px;
            margin: auto;
            text-align: center;
            text-decoration: none;
            display: inline-block;
            font-size: xx-large;
            border-radius: 10px;
            box-shadow: 0 8px 16px 0 rgba(0, 0, 0, 0.2), 0 6px 20px 0 rgba(0, 0, 0, 0.19);
        }

        .button:hover {
            box-shadow: 0 8px 16px 0 rgba(0, 0, 0, 0.2), 0 6px 20px 0 rgba(0, 0, 255, 0.80);
        }

        .button:active {
            box-shadow: 0 8px 16px 0 rgba(0, 0, 0, 0.2), 0 6px 20px 0 rgba(255, 0, 255, 0.80);
        }

        .singleStationContainer {}

        .station {
            background-color: #cccccc;
            text-decoration: none;
            margin: 5px;
            display: inline-block;
        }

        .station:hover,
        playStationButton:hover {
            background-color: rgb(86, 84, 204);
        }

        .playStationButton {
            background-color: #FFcccc;
            display: inline-block;
        }

        .volume-bar {
            position: relative;
            width: 100%;
            background-color: #666666;
            color: white;
            font-weight: bolder;
        }

        .volume-bar-fill {
            background-color: green;
        }

        .centered {
            position: absolute;
            top: 50%;
            left: 50%;
            transform: translate(-50%, -50%);
        }
    </style>
    <link href="https://fonts.cdnfonts.com/css/lcd" rel="stylesheet">
    <script>
        // develope is easier local
        var host = 'A1S-Radio-448026455F34.home'
        var websocket;


        switch (window.location.protocol) {
            case 'http:':
            case 'https:':
                if (window.location.host.split(':')[0] != '127.0.0.1') {
                    host = window.location.host
                }
                break;
            default:
        }

        ;
        websocket = new WebSocket('ws://' + host + '/ws');
        // websocket.onopen    = onOpen;
        // websocket.onclose   = onClose;
        // websocket.onmessage = onMessage; 

        function handleCommand(message) {
            console.debug("handleCommand:", message)
            if (message.includes("\t")) {
                var splitted = message.split("\t")
                var payload = message.substring(splitted[0].length + 1).trim()
                // console.debug(splitted, splitted[0].length)
                // console.debug("+" + payload + "+")
                switch (splitted[0]) {
                    case 'C':
                        document.getElementById('currentPlaying').innerHTML = payload
                        document.getElementById('station').innerHTML = '&#x2047;'
                        document.getElementById('streamInfo').innerHTML = '&#x2047;'
                        break
                    case 'V':
                        document.getElementById('volume-bar-label').textContent = payload
                        document.getElementById('volume-bar-fill').style.width = payload + '%'
                        break
                    case 'ASTA':
                        if (payload.length > 0) {
                            document.getElementById('station').textContent = payload
                        }
                        break
                    case 'ASTT':
                        if (payload.length > 0) {
                            document.getElementById('streamInfo').textContent = payload
                        }
                        break
                    default:
                        // console.debug("unhandled websocket:", event.data)
                        break
                }
            }
        }

        websocket.addEventListener("message", (event) => {
            // console.log(event.data)
            if (event.data.toString().includes("\t")) {
                handleCommand(event.data.toString())
            }
        });
        var xhr = new XMLHttpRequest();
        xhr.addEventListener("load", function () {
            var configJSon = JSON.parse(this.responseText)
            //var stations = this.responseText.trim().split("\n");
            // console.log(configJSon)
            configJSon.stations.forEach((station) => {
                var stationsDiv = document.getElementById('stations');
                var singleStationContainer = document.createElement('div');
                singleStationContainer.className = 'singleStationContainer'
                var ldiv = document.createElement('div');
                ldiv.className = 'station'
                ldiv.innerHTML = station.name + ' (' + station.url + ')';
                var playdiv = document.createElement('div');
                playdiv.innerHTML = '&#x25B6;';
                playdiv.className = 'playStationButton';
                playdiv.onclick = function () {
                    var xhr = new XMLHttpRequest();
                    xhr.timeout = 2000;
                    xhr.open("GET", "http://" + host + "/playurl?playurl=" + station.url, true);
                    xhr.send();
                };
                singleStationContainer.appendChild(playdiv);
                singleStationContainer.appendChild(ldiv);
                stationsDiv.appendChild(singleStationContainer);
            });
        });

        xhr.open("GET", "http://" + host + "/config.json");
        xhr.send();
    </script>
</head>

<body>
    <div id="streamInfo" class="lcd"></div>
    <div id="station" class="smalllcd"></div>
    <div id="currentPlaying" class="smalllcd"></div>
    <div id="volume-bar" class="volume-bar">
        <div id="volume-bar-label" class="centered">&nbsp;</div>
        <div id="volume-bar-fill" class="volume-bar-fill">&nbsp;</div>
    </div>
    <br />
    <div id="buttons" class="buttonscontainer">
        <a class="button" href="playpause" target="dummy">&#x23ef;</a>
        <a class="button" href="voldown" target="dummy">&#x1f509;</a>
        <a class="button" href="volup" target="dummy">&#x1F50A;</a>
    </div>
    <br />
    <div id="stations"></div>
    <br />
    <form action="playurl" target="dummy">
        <input type="text" name="playurl"></input>
        <input type="submit" value="play url">
    </form>
    <br />
    <br />
    <a href="/config">config</a><br />

    <iframe src="" name="dummy" style="visibility:hidden;"></iframe>
</body>

</html>
)rawliteral";

const char _DEFAULT_CONFIG[] PROGMEM = R"rawliteral(
{
    "stations": [
        {
            "name": "Radio Rock Norge",
            "url": "http://live-bauerno.sharp-stream.com/radiorock_no_mp3?direct=true"
        },
        {
            "name": "Bob SH",
            "url": "http://streams.radiobob.de/bob-shlive/mp3-128/streams.radiobob.de/play.m3u"
        },
        {
            "name": "Delta Foehnfrisur",
            "url": "http://streams.deltaradio.de/delta-foehnfrisur/mp3-128/streams.deltaradio.de/play.m3u"
        },
        {
            "name": "Bob Metal",
            "url": "http://streams.radiobob.de/bob-metal/mp3-128/streams.radiobob.de/play.m3u"
        },
        {
            "name": "NDR2",
            "url": "http://www.ndr.de/resources/metadaten/audio/m3u/ndr2_sh.m3u"
        }
    ]
}
)rawliteral";

#include "Button2.h"
Button2 button3, button4;

// SPI GPIOs
#define SD_CS 13
#define SPI_MOSI 15
#define SPI_MISO 2
#define SPI_SCK 14

