crathje/ESP32_A1S_Radio/src/main.cpp
#ifdef DAC2USE_AC101
// I2S GPIOs, the names refer on AC101, AS1 Audio Kit V2.2 2379
#define I2S_DSIN 35 // pin not used
#define I2S_BCLK 27
#define I2S_LRC 26
#define I2S_MCLK 0
#define I2S_DOUT 25
#endif

#ifdef DAC2USE_ES8388
// I2S GPIOs, the names refer on ES8388, AS1 Audio Kit V2.2 3378
#define I2S_DSIN 35 // pin not used
#define I2S_BCLK 27
#define I2S_LRC 25
#define I2S_MCLK 0
#define I2S_DOUT 26
#endif

// I2C GPIOs
#define IIC_CLK 32
#define IIC_DATA 33

// buttons
// #define BUTTON_2_PIN 13             // shared with SPI_CS
#define BUTTON_3_PIN 19
// #define BUTTON_4_PIN 23
// #define BUTTON_5_PIN 18 // Stop
// #define BUTTON_6_PIN 5  // Play

#define IIC_EXTERNAL_CLK 5
#define IIC_EXTERNAL_DATA 18
#define IIC_EXTERNAL_DATA_FREQ 400000

// amplifier enable
#define GPIO_PA_EN 21

#define ROTARY_ENCODER_A_CLK_PIN 22
#define ROTARY_ENCODER_B_DT_PIN 19
#define ROTARY_ENCODER_BUTTON_PIN 23
#define ROTARY_ENCODER_STEPS 2
ESP32Encoder rotaryEncoder;

// Switch S1: 1-OFF, 2-ON, 3-ON, 4-ON, 5-ON

#ifdef DAC2USE_AC101
static AC101 dac; // AC101
#endif

#ifdef DAC2USE_ES8388
static ES8388 dac; // ES8388 (new board)
#endif
int volume = 70; // 0...100

Audio audio;

// #ifdef U8X8_HAVE_HW_SPI
// #include <SPI.h>
// #endif
// #ifdef U8X8_HAVE_HW_I2C
// #include <Wire.h>
// #endif/
// U8G2_SSD1306_128X32_UNIVISION_1_2ND_HW_I2C u8g2(U8G2_R0 /* rotation */, /* reset=*/U8X8_PIN_NONE, IIC_EXTERNAL_DATA, IIC_EXTERNAL_CLK);
// U8G2_SH1106_128X64_NONAME_F_2ND_HW_I2C u8g2(U8G2_R0, U8X8_PIN_NONE, 4, 5);

#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 32

Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &I2C_2, -1);
volatile boolean foundDisplay = false;

// #####################################################################

void loadSaveConfig(boolean save = false)
{
  static const char *TAG = "loadSaveConfig";
  File file;
  size_t len = 0;

  bool spiffsWorking = false, configLoaded = false;
  if (!SPIFFS.begin(true))
  {
    Serial.println("An Error has occurred while mounting SPIFFS - trying to format.");
    SPIFFS.format();
    if (!SPIFFS.begin(true))
    {
      Serial.println("..still failing to mount SPIFFS");
    }
    else
    {
      spiffsWorking = true;
    }
  }
  else
  {
    spiffsWorking = true;
  }
  Serial.printf("SPIFFS: %d/%d\n", SPIFFS.usedBytes(), SPIFFS.totalBytes());
  DeserializationError derr;
  if (spiffsWorking)
  {
    file = SPIFFS.open(CONFIGFILENAME, FILE_READ);
    if (!file)
    {
      ESP_LOGI(TAG, "No saved config found.");
    }
    else
    {
      ESP_LOGI(TAG, "Found config (%d) in %s", file.size(), CONFIGFILENAME);

      unsigned char content[file.size()];
      len = file.readBytes((char *)content, file.size());
      file.close();
      ESP_LOGI(TAG, "Read %d bytes from file", len);
      ESP_LOG_BUFFER_HEXDUMP(TAG, content, len, ESP_LOG_DEBUG);
      if (len > 0)
      {
        derr = deserializeJson(configJSON, content);
        if (derr == DeserializationError::Ok)
        {
          configLoaded = true;
        }
      }
    }
    SPIFFS.end();
  }
  if (!configLoaded)
  {
    derr = deserializeJson(configJSON, _DEFAULT_CONFIG);
    if (derr == DeserializationError::Ok)
    {
      configLoaded = true;
    }
  }
  Serial.printf("configLoaded: %d size: %d stations: %d\r\n", configLoaded, configJSON.size(), configJSON["stations"].size());
}

void drawDisplay()
{
  if (foundDisplay)
  {
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setCursor(0, 0);
    String lastPlayedStationS = String(lastPlayedStation);
    char buff[100];
    sprintf(buff, "%s%s", currentStationNum < 0 ? "" : "" + String(currentStationNum) + ": ", //
            lastPlayedStationS.substring(0, 20).c_str());
    display.println(buff);
    display.println(lastPlayedStreamTitle);

    int mapped = map(volume, 0, 100, 0, SCREEN_WIDTH);
    for (int y = SCREEN_HEIGHT - 3; y < SCREEN_HEIGHT; y++)
    {
      display.drawLine(0, y, mapped, y, WHITE);
    }

    display.display();
  }
}

void onWebSocketEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type,
                      void *arg, uint8_t *data, size_t len)
{
  switch (type)
  {
  case WS_EVT_CONNECT:
    // Serial.printf("WebSocket client #%u connected from %s\n", client->id(), client->remoteIP().toString().c_str());
    client->text("C\t" + String(lastPlayedUrl));
    client->text("ASTT\t" + String(lastPlayedStreamTitle));
    client->text("ASTA\t" + String(lastPlayedStation));
    client->text("V\t" + String(volume));
    break;
  case WS_EVT_DISCONNECT:
    // Serial.printf("WebSocket client #%u disconnected\n", client->id());
    break;
  case WS_EVT_DATA:
    // handleWebSocketMessage(arg, data, len);
    break;
  case WS_EVT_PONG:
  case WS_EVT_ERROR:
    break;
  }
}

void setVolume(int value)
{
  // Serial.printf("Volume set to: %d\r\n", value);
  if (value > 100)
  {
    value = 100;
  }
  if (value < 0)
  {
    value = 0;
  }

  volume = value;
#ifdef DAC2USE_ES8388
  dac.volume(ES8388::ES_MAIN, value);
  dac.volume(ES8388::ES_OUT1, value);
  dac.volume(ES8388::ES_OUT2, value);
  dac.mute(ES8388::ES_OUT1, false);
  dac.mute(ES8388::ES_OUT2, false);
  dac.mute(ES8388::ES_MAIN, false);
#endif

#ifdef DAC2USE_AC101
  dac.setVolumeSpeaker(value);
  dac.setVolumeHeadphone(value);
#endif

  asyncWebSocket.textAll("V\t" + String(volume));
  drawDisplay();
}

void actionPlayPause() { audio.pauseResume(); }
void actionVolumeUp() { setVolume(volume + 1); }
void actionVolumeDown() { setVolume(volume - 1); }

void actionUpdateStarting()
{
  digitalWrite(GPIO_PA_EN, LOW);
// mute!
#ifdef DAC2USE_ES8388
  dac.mute(ES8388::ES_OUT1, true);
  dac.mute(ES8388::ES_OUT2, true);
  dac.mute(ES8388::ES_MAIN, true);
#endif
  audio.stopSong();

  if (foundDisplay)
  {
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(2);
    display.setCursor(0, 0);
    display.println("Updating...");
    display.display();
  }
}

void buttonClick(Button2 &btn)
{
  if (btn == button4)
  {
  }
  // else if (btn == button5)
  // {
  //   actionPlayPause();
  // }
  // else if (btn == button6)
  // {
  //   actionVolumeUp();
  // }
}

void playUrl(const char *url)
{
  audio_showstreamtitle("");
  lastPlayedStation[0] = 0;

  JsonArray array = configJSON["stations"].as<JsonArray>();
  int i = 0;
  currentStationNum = -1;
  for (JsonVariant v : array)
  {
    if (!strncmp(url, v["url"].as<string>().c_str(), strlen(url)))
    {
      // Serial.print("FOUND::: ");
      currentStationNum = i;
      sprintf(lastPlayedStation, "%s", v["name"].as<string>().c_str());
    }
    // Serial.println(v.as<string>().c_str());
    i++;
  }

  String surl = String(url);
  if (strlen(lastPlayedStation) == 0)
  {
    sprintf(lastPlayedStation, "%s", surl.substring(surl.lastIndexOf("/") + 1).c_str());
  }
  audio_showstation(lastPlayedStation);
  strcpy(lastPlayedUrl, url);
  asyncWebSocket.textAll("C\t" + String(url));
  audio.connecttohost(url);
}

