crathje/ESP32_A1S_Radio/src/main.cpp
void changeSationIndex(int newIndex)
{
  JsonArray array = configJSON["stations"].as<JsonArray>();
  int i = 0;
  for (JsonVariant v : array)
  {
    if (i == newIndex)
    {
      currentStationNum = newIndex;
      playUrl(v["url"].as<string>().c_str());
      return;
    }
    i++;
  }
  // not found, not changing anything
}

void setup()
{
  Serial.begin(115200);
  Serial.println("\r\nReset");

  uint64_t chipid = ESP.getEfuseMac(); // The chip ID is essentially its MAC
                                       // address(length: 6 bytes).
  Serial.println(F("===== CHIP INFO ====="));
  Serial.printf_P(PSTR("ChipID:            %04X%08X\r\n"),
                  (uint16_t)(chipid >> 32), (uint32_t)chipid);
  Serial.printf_P(PSTR("ChipCores:         %d\r\n"), ESP.getChipCores());
  Serial.printf_P(PSTR("CpuFreqMHz:        %3d\r\n"), ESP.getCpuFreqMHz());
  Serial.printf_P(PSTR("ChipRevision:      %d\r\n"), ESP.getChipRevision());
  Serial.printf_P(PSTR("FreeHeap:          %3d\r\n"), ESP.getFreeHeap());
  Serial.printf_P(PSTR("CycleCount:        %3d\r\n"), ESP.getCycleCount());
  Serial.printf_P(PSTR("SdkVersion:        %s\r\n"), ESP.getSdkVersion());
  Serial.printf_P(PSTR("FlashChipSize:     %3d\r\n"), ESP.getFlashChipSize());
  // DebugHWSerial.printf("FlashChipRealSize: %3d\n"),
  // ESP.getFlashChipRealSize());
  Serial.printf_P(PSTR("FlashChipSpeed:    %3d\r\n"), ESP.getFlashChipSpeed());
  Serial.printf_P(PSTR("FlashChipMode:     %d\r\n"), ESP.getFlashChipMode());
  Serial.printf_P(PSTR("SketchSize:        %d\r\n"), ESP.getSketchSize());
  Serial.printf_P(PSTR("FreeSketchSpace:   %d\r\n"), ESP.getFreeSketchSpace());
  Serial.printf_P(PSTR("ArduinoStack:      %d\r\n"),
                  getArduinoLoopTaskStackSize());
  Serial.printf_P(PSTR("ArduinoVersion:    %d.%d.%d\r\n"),
                  ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR,
                  ESP_ARDUINO_VERSION_PATCH);

  // pinMode(BUTTON_3_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_4_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_5_PIN, INPUT_PULLUP);
  // pinMode(BUTTON_6_PIN, INPUT_PULLUP);

  // button3.begin(BUTTON_3_PIN);
  // button3.setClickHandler(buttonClick);
  // button4.begin(BUTTON_4_PIN);
  // button4.setClickHandler(buttonClick);
  // button5.begin(BUTTON_5_PIN);
  // button5.setClickHandler(buttonClick);
  // button6.begin(BUTTON_6_PIN);
  // button6.setClickHandler(buttonClick);

  loadSaveConfig();

  pinMode(SD_CS, OUTPUT);
  digitalWrite(SD_CS, HIGH);
  SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI);
  SPI.setFrequency(1000000);

  Serial.println(F("===== SD CARD INFO ====="));
  if (SD.begin(SD_CS))
  {
    Serial.printf_P(PSTR("cardType:   %d\r\n"), SD.cardType());
    Serial.printf_P(PSTR("cardSize:   %lld\r\n"), SD.cardSize());
    Serial.printf_P(PSTR("totalBytes: %lld\r\n"), SD.totalBytes());
    Serial.printf_P(PSTR("usedBytes:  %lld\r\n"), SD.usedBytes());
  }
  else
  {
    Serial.println(F("SD Init failed."));
  }

  AsyncWiFiManager wifiManager(&asyncWebServer, &dnsServer);
  sprintf(hostname, "A1S-Radio-%04X%08X", (uint16_t)(chipid >> 32),
          (uint32_t)chipid);
  WiFi.setHostname(hostname);
  wifiManager.autoConnect(hostname, NULL);

  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, PUT");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type");

  asyncWebServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
                    { request->send_P(200, "text/html", index_html); });
  asyncWebServer.on("/config.json", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    AsyncResponseStream *response = request->beginResponseStream("application/json");
    // JsonObject root = configJSON.to<JsonObject>();
    serializeJsonPretty(configJSON, *response);
    request->send(response); });
  asyncWebServer.on("/config.json", HTTP_POST, [](AsyncWebServerRequest *request)
                    {
                int params = request->params();
                for (int i = 0; i < params; i++) {
                  const AsyncWebParameter* p = request->getParam(i);
                  Serial.printf("POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
                  if (p->name() == "config") {
                    // if (validateJson(p->value())) {
                      DeserializationError dret = deserializeJson(configJSON, p->value());
                      if (dret == DeserializationError::Ok) {
                        if (SPIFFS.begin(true)) {                            
                          File file = SPIFFS.open(CONFIGFILENAME, "w", true);
                          if (file)
                          {
                            serializeJson(configJSON, file);
                            file.close();
                            Serial.println("Config has been saved");
                          }
                          request->redirect("/config");
                          SPIFFS.end();
                          return;
                        } else {
                          request->send_P(500, "text/html", "Could not mount SPIFFS");
                          return;
                        }
                      }
                    // } 
                  }
                }
                request->send_P(500, "text/html", "Failed"); });
  asyncWebServer.on("/config", HTTP_GET, [](AsyncWebServerRequest *request)
                    { 
                char json[_MAX_JSONBUFFERSIZE];
                serializeJsonPretty(configJSON, json);
                request->send(200, "text/html", String() + "<html><body><form action=\"/config.json\" method=\"POST\"><textarea name=\"config\" cols=\"100\" rows=\"35\">" + json + "</textarea><br /><button>Save</button></form></body></html>"); });

  asyncWebServer.on("/playpause", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionPlayPause(); });
  asyncWebServer.on("/playurl", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    if (request->hasParam("playurl")) {
      String url = request->getParam("playurl")->value();
      playUrl(url.c_str());
      request->send(200, "text/plain", "OK");
      return;
    }
    request->send(200, "text/plain", "FAILED"); });
  asyncWebServer.on("/volup", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionVolumeUp(); });
  asyncWebServer.on("/voldown", HTTP_GET, [](AsyncWebServerRequest *request)
                    {
    request->send(200, "text/plain", "OK");
    actionVolumeDown(); });

  asyncWebServer.on("/data.json", HTTP_GET, [](AsyncWebServerRequest *request)
                    { request->send(200, "application/json", String()                                                                   //
                                                                 + F("{")                                                               //
                                                                 + F("\n  \"lastPlayedUrl\": \"") + String(lastPlayedUrl) + F("\"")     //
                                                                 + F("\n, \"rssi\": \"") + String(WiFi.RSSI()) + F("\"")                //
                                                                 + F("\n, \"hostname\": \"") + String(WiFi.getHostname()) + F("\"")     //
                                                                 + F("\n, \"SSID\": \"") + String(WiFi.SSID()) + F("\"")                //
                                                                 + F("\n, \"compile_date\": \"") + String(compile_date) + F("\"")       //
                                                                 + F("\n, \"sdk_version\": \"") + String(ESP.getSdkVersion()) + F("\"") //
                                                                 + F("\n, \"PIO_ENV\": \"") + String(PIO_ENV) + F("\"") + F("\n}")); });

  asyncWebSocket.onEvent(onWebSocketEvent);
  asyncWebServer.addHandler(&asyncWebSocket);

  asyncWebServer.begin();

